import random

g1 = ["Баззис", "Баланцев", "Назарова", "Симаков", "Синило", "Кожухова", "Макрушин", "Шербина", "Холтобина", "Шабров"]
g2 = ["Ааев", "Ббэев", "Ввэев", "Ггэев", "Ддэев", "Ееев", "Жжэев", "Ззэев", "Иванов", "Ккаев"]

t = tuple(random.sample(g1, 5) + random.sample(g2, 5))
IvCount = t.count("Иванов")

print("Группа 1: ",g1)
print("Группа 2: ",g2)
print("Команда: ",t)
print("Длина Команды:", len(t))
print("Команда по алфавиту: ",sorted(t))
print("Фамилия 'Иванов' в команде: ",("встречается" if IvCount > 0 else "не встречается"))
if IvCount > 0:
    print("Количество раз: ",IvCount)
